[{
  "id": 1,
  "title": "Beginning C++ Programming",
  "price": 84.99,
  "img": "https://i.ibb.co/VB2csJG/c.png",
  "instructor": "Dr. Frank Mitropoulos",
  "body": "much if not most of the software written today is still\n      written in\n       C++ and this has been the case for many many years \n  Not only is C++ popular but it is also a very relevant language. If you go to GitHub you will see that there are a huge number \n  of active C++ repositories and C++ is also extremely active on stack overflow\n  \n  There are many many leading software titles written entirely or partly in C++. These include the Windows Linux and Mac OSX operating systems\n  \n  Many of the Adobe products such as Photoshop and Illustrator the MySQL and MongoDB database engines and many many more are written in C++.\n  \n  Leading tech companies use C++ for many of their products and internal research and development. These include Amazon Apple Microsoft\n   PayPal Google Facebook Oracle and many more"
},
{
  "id": 2,
  "title": "Just Express In detail.",
  "price": 59.99,
  "img": "https://i.ibb.co/yq1cqf1/expressjs.png",
  "instructor": "Robert Bunch",
  "body": "You have some notion of what Node, Express, and http are or you wouldn't be here. Node and back-end JavaScript \n  have taken the world by storm, [SOME BIG COMPANY] moved to node and it changed the world, blah blah blah. One of the first\n   things you're going to learn in any node course is about the Express module. But how much do you really learn about it? How to render a page in one template engine? How to make a get and a post route? Most MEAN and MERN stacks students I've met learned Express in a few breaths and then moved on to MongoDB, MySQL, Angular, React, or whatever was in the rest of the tech stack. What is http anyway? Should I even care? It's easy to get 2 inches deep and find you've accomplished your task, but in fact have no idea why it works or how you'd go further. That, in my opinion, is no good for someone who wants to be a great developer.\n  \n  I've had a lot of students ask for a course on just Express js because they were either overwhelmed when they learned it, or they can't find any detail on it to go further than beginner knowledge. That's what this course is for. We will go through the various pieces of Express in detail so you can know why it behaves the way it does and get the most out of it. Express 5 is currently in alpha, so when it hits beta or full release, and as questions come up, the course will expand accordingly!"
},
{
  "id": 3,
  "title": "The Complete JavaScript Course 2022",
  "price": 64.99,
  "img": "https://i.ibb.co/y63FtWt/java-Script.png",
  "instructor": "Jonas Schmedtmann",
  "body": "'Really, really well made course. Super in-depth, with great challenges and projects that will solidify your Javascript understanding. I found the lectures were paced perfectly -- Jonas doesn't skip over anything that might be useful to a JS developer'— Carson Bartholomew\n  \n  \n  \n  JavaScript is the most popular programming language in the world. It powers the entire modern web. It provides millions of high-paying jobs all over the world.\n  \n  That's why you want to learn JavaScript too. And you came to the right place!"
},
{
  "id": 4,
  "title": "NodeJS - The Complete Guide",
  "price": 84.99,
  "img": "https://i.ibb.co/myvbgdY/Nodejs.png",
  "instructor": "Maximilian",
  "body": "s this course for you?\n  \n  If you got no Node.js experience, you'll love this course because it starts with zero knowledge assumed. It's the perfect course to become a Node.js developer.\n  \n  If you got basic Node.js experience, this course is also a perfect match because you can go through the basic modules quickly and you'll benefit from all the deep dives and advanced topics the course covers.\n  \n  Are you an advanced Node.js user? Check the curriculum then. Maybe you found no other course that shows how to use SQL with Node.js. Or you're interested in GraphQL. Chances are, that you'll get a lot of value out of this course, too!"
},
{
  "id": 5,
  "title": "Complete Python Pro",
  "price": 76.99,
  "img": "https://i.ibb.co/Jy0046d/Python.png",
  "instructor": "Dr. Angela Yu",
  "body": "Become a Python Programmer and learn one of employer's most requested skills of 2022!\n  \n  This is the most comprehensive, yet straight-forward, course for the Python programming language on Udemy! Whether you have never programmed before, already know basic syntax, or want to learn about the advanced features of Python, this course is for you! In this course we will teach you Python 3.\n  \n  With over 100 lectures and more than 21 hours of video this comprehensive course leaves no stone unturned! This course includes quizzes, tests, coding exercises and homework assignments as well as 3 major projects to create a Python project portfolio!\n  \n  Learn how to use Python for real-world tasks, such as working with PDF Files, sending emails, reading Excel files, Scraping websites for informations, working with image files, and much more!\n  \n  This course will teach you Python in a practical manner, with every lecture comes a full coding screencast and a corresponding code notebook! Learn in whatever manner is best for you!\n  \n  We will start by helping you get Python installed on your computer, regardless of your operating system, whether its Linux, MacOS, or Windows, we've got you covered."
},
{
  "id": 6,
  "title": "Complete React Developer",
  "price": 94.99,
  "img": "https://i.ibb.co/r6dJNjW/ReactJS.png",
  "instructor": "Jhankar Mahbub",
  "body": "Just FULLY updated and re-recorded with all new React features for 2022 (React v18)! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with React.js.\n  \n  Using the latest version of React (React 18), this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies.\n  \n  We guarantee you this is the most comprehensive online resource on React. This project based course will introduce you to all of the modern toolchain of a React developer in 2022. Along the way, we will build a massive e-commerce application similar to Shopify using React, Redux, React Hooks, React Suspense, React Router, GraphQL, Context API, Firebase, Redux-Saga, Stripe + more. This is going to be a full stack app (MERN stack), using Firebase.\n  \n  The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional React project all the way into production. We will start from the very beginning by teaching you React Basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future ReactJS projects.\n  \n  All code is going to be provided step by step and even if you don’t like to code along, you will get access to the the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away."
}
]